the dataset on kaggle:https://www.kaggle.com/kaggle/sf-salaries

In [20]:
import pandas as pd

In [23]:
df = pd.read_csv('Salaries.csv')
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,Unnamed: 13
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,NaN,San Francisco,PT,NaN
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,NaN,San Francisco,PT,NaN

show the first 5 rows

In [24]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,Unnamed: 13
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,NaN

information about dataset

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 14 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
 13  Unnamed: 13       0 non-null       float64
dtypes: float64(4), int64(2), object(8)
memory usage: 15.9+ MB

In [26]:
df.describe()

,Id,TotalPay,TotalPayBenefits,Year,Notes,Unnamed: 13
count,148654.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [27]:
df['EmployeeName'] == 'ALBERT PARDINI'

0         False
1         False
2          True
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: EmployeeName, Length: 148654, dtype: bool

display ALBERT PARDINI row

In [28]:
df[df['EmployeeName'] == 'ALBERT PARDINI']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,Unnamed: 13
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,NaN

display ALBERT PARDINI jobtitel cell

In [29]:
df[df['EmployeeName'] == 'ALBERT PARDINI']['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

How much does ALBERT PARDINI  make (with benfits)?

In [30]:
df[df['EmployeeName'] == 'ALBERT PARDINI']['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

the name of highest paid person(include benefits)

In [31]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

the name of lowest paid person(include benefits)

In [32]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

the average of all employees per year(2011,2014)

In [33]:
df.groupby('Year').mean()

            Id      TotalPay  TotalPayBenefits  Notes  Unnamed: 13
Year
2011   18080.0  71744.103871      71744.103871    NaN          NaN
2012   54542.5  74113.262265     100553.229232    NaN          NaN
2013   91728.5  77611.443142     101440.519714    NaN          NaN
2014  129593.0  75463.918140     100250.918884    NaN          NaN

unique jop titles

In [34]:
df['JobTitle'].nunique()

2159

top 5 most popular jops

In [35]:
df['JobTitle'].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

Job title were represented by only one person in 2013

In [36]:
df[df['Year']==2013]['JobTitle'].value_counts()

Transit Operator                 2295
Special Nurse                    1445
Registered Nurse                 1231
Public Svc Aide-Public Works      859
Custodian                         789
                                 ...
Mayoral Staff XII                   1
Director, Human Resources           1
Senior Pharmacy Helper              1
Director, Info Tech Group           1
Ex Asst to Ex Dir, Retirement       1
Name: JobTitle, Length: 1051, dtype: int64

In [37]:
(df[df['Year']==2013]['JobTitle'].value_counts()== 1)

Transit Operator                 False
Special Nurse                    False
Registered Nurse                 False
Public Svc Aide-Public Works     False
Custodian                        False
                                 ...
Mayoral Staff XII                 True
Director, Human Resources         True
Senior Pharmacy Helper            True
Director, Info Tech Group         True
Ex Asst to Ex Dir, Retirement     True
Name: JobTitle, Length: 1051, dtype: bool

In [38]:
(df[df['Year']==2013]['JobTitle'].value_counts()== 1).sum()

202

How many people have the word chief in their job title ?

In [39]:
def chief(string):
    if'chief' in (string.lower()):
        return True
    else:
        return False

In [40]:
df['JobTitle'].apply(lambda x:chief(x))

0         False
1         False
2         False
3         False
4          True
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [41]:
(df['JobTitle'].apply(lambda x:chief(x))).sum()

627

Is there a correlation between length of the job title string and salary ?

In [42]:
df['ntitle'] = df["JobTitle"].apply(len)

In [43]:
df['ntitle']

0         46
1         31
2         31
3         36
4         44
          ..
148649     9
148650    12
148651    12
148652    12
148653    26
Name: ntitle, Length: 148654, dtype: int64

In [44]:
df[['ntitle','TotalPayBenefits']].corr()

                    ntitle  TotalPayBenefits
ntitle            1.000000         -0.036878
TotalPayBenefits -0.036878          1.000000